Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType.GetSolarHeatGainCoefficientsForSolarIndicientAngles
Returns a map with solar heat gain coefficients (SHGC-values) for specific incident angles for the window type.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType.Transmittance
The visual light transmittance value (VLT-value) for the window type.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType.SolarHeatGainCoefficient
The solar heat gain coefficient (SHGC-value) for the window type.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType.HeatTransferCoefficient
The heat transfer coefficient value (U-value) of the window type.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType.Description
The description of the window type.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType.WindowTypeName
The name of the window type.
Since:
2024

Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType
The EnergyAnalysisWindowType class contains window type data for gbXml export.
Since:
2024